Model: "cosine"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense_10 (Dense)             (None, 64)                128       
_________________________________________________________________
dense_11 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_12 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_13 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_14 (Dense)             (None, 64)                4160      
_________________________________________________________________
Outputs (Dense)              (None, 1)                 65        
=================================================================
Total params: 16,833
Trainable params: 16,833
Non-trainable params: 0
_________________________________________________________________
