Model: "cosine"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense (Dense)                (None, 64)                128       
_________________________________________________________________
Outputs (Dense)              (None, 1)                 65        
=================================================================
Total params: 193
Trainable params: 193
Non-trainable params: 0
_________________________________________________________________
