Model: "square"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                128       
_________________________________________________________________
dense_4 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_5 (Dense)              (None, 64)                4160      
_________________________________________________________________
Outputs (Dense)              (None, 1)                 65        
=================================================================
Total params: 8,513
Trainable params: 8,513
Non-trainable params: 0
_________________________________________________________________
