Model: "square"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                128       
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
Outputs (Dense)              (None, 1)                 65        
=================================================================
Total params: 4,353
Trainable params: 4,353
Non-trainable params: 0
_________________________________________________________________
