Model: "square"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                128       
_________________________________________________________________
dense_16 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_17 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_18 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_19 (Dense)             (None, 64)                4160      
_________________________________________________________________
dense_20 (Dense)             (None, 64)                4160      
_________________________________________________________________
Outputs (Dense)              (None, 1)                 65        
=================================================================
Total params: 20,993
Trainable params: 20,993
Non-trainable params: 0
_________________________________________________________________
