Model: "square"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense (Dense)                (None, 128)               256       
_________________________________________________________________
Outputs (Dense)              (None, 1)                 129       
=================================================================
Total params: 385
Trainable params: 385
Non-trainable params: 0
_________________________________________________________________
