Model: "inverse"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Inputs (InputLayer)          [(None, 1)]               0         
_________________________________________________________________
dense_7 (Dense)              (None, 16)                32        
_________________________________________________________________
dense_8 (Dense)              (None, 16)                272       
_________________________________________________________________
dense_9 (Dense)              (None, 16)                272       
_________________________________________________________________
dense_10 (Dense)             (None, 16)                272       
_________________________________________________________________
dense_11 (Dense)             (None, 16)                272       
_________________________________________________________________
dense_12 (Dense)             (None, 16)                272       
_________________________________________________________________
dense_13 (Dense)             (None, 16)                272       
_________________________________________________________________
dense_14 (Dense)             (None, 16)                272       
_________________________________________________________________
Outputs (Dense)              (None, 1)                 17        
=================================================================
Total params: 1,953
Trainable params: 1,953
Non-trainable params: 0
_________________________________________________________________
